{
  "id": "CARESSES",
  "name": "CARESSES",
  "short_name": "CARESSES",
  "url":  "http://caressesrobot.org/en/",
  "src":  "https://github.com/Suman7495/Robot-Navigation-for-Vision-Based-HAR/tree/master/Vision%20Based%20Navigation%20for%20HAR/ontology",
  "year": "2017-",
  "maintainer":     "Department of Informatics, Bioengineering, Robotics, and Systems Engineering, University of Genoa",
  "maintainer_url": "https://www.dibris.unige.it/en/",
  "text": "CARESSES is an international, multidisciplinary project whose goal is to design the first robots that can assist older people and adapt to the culture of the individual they are taking care of. The robots will help the users in many ways including reminding them to take their medication, encouraging them to keep active, helping them keep in touch with family and friends. Each action will be performed with attention to the older person’s customs, cultural practices and individual preferences.",
  "publications": [
    {
        "short": "Menicatti et al. 2017",
        "text": "Menicatti, Roberto, Barbara Bruno, and Antonio Sgorbissa (2017). Modelling the influence of cultural information on vision-based human home activity recognition. In: International conference on ubiquitous robots and ambient intelligence (URAI). IEEE, pp. 32-38.",
        "cogs": ["cog-rec"]
    },
    {
        "short": "Bruno et al. 2019",
        "text": "Bruno, Barbara, Carmine Tommaso Recchiuto, et al. (2019). Knowledge Representation for Culturally Competent Personal Robots: Requirements, Design Principles, Implementation, and Assessment. In: International Journal of Social Robotics11.3, pp. 515-538.",
        "cogs": ["cog-dec", "cog-reas", "cog-inter"]
    },
    {
        "short": "Sgorbissa et al. 2018",
        "text": "Sgorbissa, Antonio et al. (2018). Encoding guidelines for a culturally competent robot for elderly care. In: IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). IEEE, pp. 1988-1995",
        "cogs": ["cog-exec"]
    },
    {
        "short": "Bruno et al. 2018",
        "text": "Bruno, Barbara, Roberto Menicatti, et al. (2018). Culturally-Competent Human-Robot Verbal Interaction. In: International Conference on Ubiquitous Robots (UR). IEEE,pp. 388-395.",
        "cogs": ["cog-inter"]
    }
  ]
}


